# -*- coding: utf-8 -*-
# @Time : 2021/12/25 0:59
# @Author : jony wang
# @File : demowhilesum2.py
'''计算1-100之间偶数的和'''
'''
1、初始化变量
2、条件判断
3、条件执行体（循环体）
4、改变变量
'''
a = 1  # 初始化变量，因为1-100，从1开始，所以初始化变量为1
sum = 0  # 用于存储偶数
while a <= 100:  # 条件判断
    '''条件执行体（循环体）'''
    if a % 2:  # if a%2==0:
        sum += a  # 将变化的a,赋值给sum
    a += 1
print('1-100的偶数和:', sum)

'''代码改进'''
'''计算1-100之间偶数的和'''
a = 1
sum = 0
while a <= 100:
    '''条件执行体（循环体）'''
    if not bool(a % 2):  # bool(a%2)为True,表示奇数；为False，表示为偶数
        sum += a
    a += 1
print('1-100的偶数和:', sum)
